9/data/attachments/15665516a5d4f5a7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_8f9509b4-4cfb-43f9-9e9d-1a7601f3ac5e</nif:username>
            <nif:friendToBeAdded>Ashley_base_Friend_63656_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>